mock-api/artillery/02-load-test.yml
config:
  target: 'http://localhost:3001'

  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm-up - 5 req/s'

    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp-up - 10 to 50 req/s'

    - duration: 120
      arrivalRate: 50
      name: 'Sustained load - 50 req/s'

    - duration: 30
      arrivalRate: 100
      name: 'Peak - 100 req/s'

    - duration: 30
      arrivalRate: 10
      name: 'Cooldown - 10 req/s'

  processor: './processor.cjs'

scenarios:
  - name: 'Mixed operations'
    weight: 50
    flow:
      - get:
          url: '/api/users'

      - think: 1

      - post:
          url: '/api/users'
          json:
            name: '{{ $randomString() }}'
            email: '{{ $randomString() }}@example.com'

      - think: 2

      - get:
          url: '/api/users/{{ $randomNumber(1, 10) }}'

  - name: 'Intensive read'
    weight: 40
    flow:
      - loop:
          - get:
              url: '/api/users?page={{ $randomNumber(1, 5) }}'

          - get:
              url: '/api/users/{{ $randomNumber(1, 20) }}'
        count: 3

  - name: 'Intensive write'
    weight: 10
    flow:
      - post:
          url: '/api/users'
          json:
            name: 'User {{ $randomString() }}'
            email: 'user{{ $randomNumber(1, 10000) }}@example.com'

      - post:
          url: '/api/users'
          json:
            name: 'User {{ $randomString() }}'
            email: 'user{{ $randomNumber(1, 10000) }}@example.com'